//
//  CommonString.swift
//  meditation
//
//  Created by Ilya Medvedev on 25.12.2021.
//

import Foundation

enum CommonString {
    
    static let lifeInHormony = "Жизнь в гармонии с собой"
    
    static let email = "E-mail"
    static let password = "Пароль"
    static let name = "Имя"
    static let phone = "Телефон"
    
    static let createAccount = "Создать аккаунт"
    static let sendCode = "Выслать код подтверждения"
    
    static let privacyPoliticsFirstHalf = "Продолжая регистрацию, вы соглашаетесь с\n"
    static let privacyPoliticsSecontHalf = "Политикой конфиденциальности"
    
    static let or = "или"
    static let allreadyHaveAccount = "Уже есть аккаунт?"
    static let enter = "Войти"
    
    static let privacyPolitic = "Политика конфиденциальности"
    static let privacyPoliticText = "Компания Медитации создала приложение  как коммерческое. Эта УСЛУГА предоставляется Медитациями и предназначена для использования «как есть».\n\nЭта страница используется для информирования посетителей о нашей политике в отношении сбора, использования и раскрытия Личной информации, если кто-либо решил использовать наш Сервис.\n\nЕсли вы решите использовать наш Сервис, вы соглашаетесь на сбор и использование информации в отношении этой политики. Личная информация, которую мы собираем, используется для предоставления и улучшения Сервиса. Мы не будем использовать или передавать вашу информацию кому-либо, кроме случаев, описанных в настоящей Политике конфиденциальности.\n\nТермины, используемые в настоящей Политике конфиденциальности, имеют то же значение, что и в наших Положениях и условиях, которые доступны на Медитациях, если иное не определено в настоящей Политике конфиденциальности.\n\nСбор и использование информации\nДля лучшего опыта при использовании нашего Сервиса мы можем потребовать от вас предоставить нам определенную личную информацию, включая, помимо прочего, Penguin. Информация, которую мы запрашиваем, будет храниться нами и использоваться, как описано в этой политике конфиденциальности.\n\nПриложение использует сторонние сервисы, которые могут собирать информацию, используемую для вашей идентификации.\n\nСсылка на политику конфиденциальности сторонних поставщиков услуг, используемых приложением\nСервисы Google Play\nFlurry Analytics\nAppLovin\nVungle\nСегмент\nДанные журнала\n\nМы хотим сообщить вам, что всякий раз, когда вы используете нашу Службу, в случае ошибки в приложении мы собираем данные и информацию (через сторонние продукты) на вашем телефоне, называемые данными журнала. Эти данные журнала могут включать такую ​​информацию, как IP-адрес вашего устройства, имя устройства, версия операционной системы, конфигурация приложения при использовании нашего Сервиса, время и дата использования вами Сервиса, а также другие статистические данные. .\n\nПеченье\n\nФайлы cookie - это файлы с небольшим объемом данных, которые обычно используются в качестве анонимных уникальных идентификаторов. Они отправляются в ваш браузер с веб-сайтов, которые вы посещаете, и хранятся во внутренней памяти вашего устройства.\n\nЭтот Сервис не использует эти «куки» явно. Однако приложение может использовать сторонний код и библиотеки, которые используют файлы cookie для сбора информации и улучшения своих услуг. У вас есть возможность принять или отклонить эти файлы cookie и узнать, когда файл cookie отправляется на ваше устройство. Если вы решите отказаться от наших файлов cookie, возможно, вы не сможете использовать некоторые части этого Сервиса.\n\nПоставщики услуг\n\nМы можем нанимать сторонние компании и частных лиц по следующим причинам:\n\nДля облегчения нашего Сервиса;\nДля предоставления Сервиса от нашего имени;\nДля оказания услуг, связанных с Сервисом; или же\nЧтобы помочь нам проанализировать, как используется наш Сервис.\nМы хотим проинформировать пользователей этого Сервиса о том, что эти третьи стороны имеют доступ к вашей Личной информации. Причина в том, чтобы выполнять поставленные перед ними задачи от нашего имени. Однако они обязаны не раскрывать и не использовать информацию для каких-либо других целей.\n\nБезопасность\n\nМы ценим ваше доверие к предоставлению нам вашей личной информации, поэтому мы стремимся использовать коммерчески приемлемые средства ее защиты. Но помните, что ни один метод передачи через Интернет или метод электронного хранения не является на 100% безопасным и надежным, и мы не можем гарантировать его абсолютную безопасность.\n\nСсылки на другие сайты\n Этот Сервис может содержать ссылки на другие сайты. Если вы нажмете на стороннюю ссылку, вы будете перенаправлены на этот сайт. Обратите внимание, что эти внешние сайты не управляются нами. Поэтому мы настоятельно рекомендуем вам ознакомиться с Политикой конфиденциальности этих веб-сайтов. Мы не контролируем и не несем ответственности за контент, политику конфиденциальности или действия любых сторонних сайтов или служб.\n\nКонфиденциальность детей\nЭти Услуги не предназначены для лиц младше 13 лет. Мы сознательно не собираем личную информацию от детей младше 13 лет. В случае, если мы обнаруживаем, что ребенок младше 13 лет предоставил нам личную информацию, мы немедленно удаляем ее с наших серверов. Если вы являетесь родителем или опекуном и знаете, что ваш ребенок предоставил нам личную информацию, свяжитесь с нами, чтобы мы могли предпринять необходимые действия.\nИзменения в настоящей Политике конфиденциальности\nМы можем время от времени обновлять нашу Политику конфиденциальности. Таким образом, вам рекомендуется периодически просматривать эту страницу на предмет изменений. Мы уведомим вас о любых изменениях, разместив новую Политику конфиденциальности на этой странице.\nЭта политика действует с 2021-04-01.\n\nСвяжитесь с нами\n\nЕсли у вас есть какие-либо вопросы или предложения относительно нашей Политики конфиденциальности, не стесняйтесь обращаться к нам по адресу Penguin@gmail.com.\n\nЭта страница политики конфиденциальности была создана на сайте privacypolicytemplate.net и изменена / сгенерирована Генератором политики конфиденциальности приложений."
    
    
    static let youEnterWrongCode = "Вы ввели неправильный код"
    static let codeDidntCome = "Не пришел код?"
    static let sendAgain = "Отправить снова"
    
    
    //MARK: - Errors
    
    static let thisNumberDoesntExist = "Такого номера не существует"
    static let wrongEmailOrPassword = "Неправильный email или пароль"
    static let wrongLoginOrPassword = "Неправильный логин или пароль"
    
    
    static let forgotPassword = "Забыли пароль?"
    static let restore = "Восстановить"
    
    static let restorePassword = "Восстановить пароль"
    
    static let firstMainStep = "Первый важный шаг"
    static let firstMainStepSubtitle = "Укажите адрес электронной почты, чтобы подписаться на рассылку полезной информации."
    static let further = "Далее"
    static let back = "Назад"
    static let questionOutOf = "вопрос из"
    
    static let panicTitle = "Бывают ли у Вас\nпанические атаки?"
    static let panicSubtitle = "Выберите подходящий ответ ниже. Какая из\nкартинок больше отображает ваше состояние?"
    
    static let relationshipTitle = "Есть ли у Вас проблемы\nв отношениях?"
    static let relationshipSubtitle = "Выберите подходящий ответ ниже. Какая из\nкартинок больше отображает ваше состояние?"
    
    static let healthTitle = "Есть ли у Вас тревога и\nстрахи за здоровье?"
    static let healthSubtitle = "Выберите подходящий ответ ниже. Какая из\nкартинок больше отображает ваше состояние?"
    
    static let emotionsWorkTitle = "С какими эмоциями вы\nбы хотели поработать?"
    static let emotionsWorkSubtitle = "Выберите подходящий ответ ниже. Какая из\nкартинок больше отображает ваше состояние?"
    
    static let anxiety = "Тревога"
    static let anger = "Гнев"
    static let jealousy = "Ревность"
    static let gilt = "Вина"
    static let fear = "Страх"
    static let loneliness = "Одиночество"
    static let shame = "Стыд"
    
    static let main = "Главная"
    static let profile = "Профиль"
    
    static let happyToSeeYou = "Рады видеть тебя,"
    static let recomendForYou = "Рекомендуемое Вам"
    
    static let podcastTheme = "Тематика подкастов"
    static let more = "Подробнее"
    
    static let audiolessons = "Аудиоуроков"
}
